ednieuw/ESP32-2432S028R-display/ESP322432S028_WordClockV016/ESP322432S028_WordClockV016.ino
/* 

--------------------------------------  
 Author .    : Ed Nieuwenhuys
 Changes V001: Derived from ESP32C3S3_WordClockV028
 Changes V006: Display not working. Corrected SetRTCtime() struct timeval now = { .tv_sec = t , .tv_usec = t}; --> struct timeval now = { .tv_sec = t , .tv_usec = 0};
 Changes V007: Struggle to find out GPIO 2 can not be used to readLDR value. 
 Changes V008: Struggle to find out GPIO 2 can not be used to readLDR value. reading GPIO2 freezes the display
 Changes V010: Doet het weer
 Changes V011: Clean up
 Changes V012: Stable. ADAfruit library instead of TFT_eSPI(too compkicated with setup.h etc., 
 Changes V013: LEDs working
 Changes V014: To make: Use LEDc to set PWM on LEDs and Backlight --> LDR responds irregular. Not using it.
 Changes V015: Stable. Turn off backlight when LEDs, = character printing, are off. Used LEDc PWM on backlight at 50%.
 Changed V016: 
                 // ledcSetup(0, 250, 8);        //ledChannel, freq, resolution);                               // configure LED PWM functionalitites 5000 Hz, 8 bits
                // ledcAttachPin(TFT_LED, 0);  //ledPin, ledChannel);                                           // ILI9341 backlight on ledchannel 0 and GPIO pin TFT_LED
                   ledcAttachChannel(TFT_LED, 250,8, 0);  //ledPin, ledChannel);                                //For esp32 board 3.0 and higher used in  ILI9341 backlight on ledchannel 0 and GPIO pin TFT_LED 

 Changed ESP32 board to 3.0.0
               Changed in Arduino\libraries\ESPAsyncWebServer\src\WebAuthentic
               at line 75,76,77   
               //-----------------              
                #ifdef ESP_ARDUINO_VERSION_MAJOR
                   #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
                     // Code for version 3.x
                   mbedtls_md5_init(&_ctx);
                   mbedtls_md5_starts(&_ctx);
                   mbedtls_md5_update(&_ctx, data, len);
                   mbedtls_md5_finish(&_ctx, _buf);
                   #else
                    // Code for version 2.x
                   #ifdef ESP32
                      mbedtls_md5_init(&_ctx);
                      mbedtls_md5_starts_ret(&_ctx);
                      mbedtls_md5_update_ret(&_ctx, data, len);
                      mbedtls_md5_finish_ret(&_ctx, _buf);
                   #else
                      MD5Init(&_ctx);
                      MD5Update(&_ctx, data, len);
                      MD5Final(_buf, &_ctx);
                    #endif
                 #endif
                #endif
               //-------------------- 
               in AsyncEventSource.cpp changed at line 189 ets_printf --> log_e for V3
               in AsyncWebSocket.cpp changed at line 549 ets_printf --> log_e  for V3
                 #ifdef ESP_ARDUINO_VERSION_MAJOR
                   #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
                     // Code for version 3.x
                    log_e("ERROR: Too many messages queued\n");
                   #else
                    // Code for version 2.x
                    ets_printf("ERROR: Too many messages queued\n");
                 #endif
                #endif  
                
               



 LDR not working on my board
 Basic tests: https://github.com/witnessmenow/ESP32-Cheap-Yellow-Display/tree/main/Examples/Basics
 

How to compile: Install ESP32 boards
Set to:
Board: ESP32 DEV module
Flash size 4MB
Patition Scheme: Default or change to Minimal SPIFFS (1.9Mb with OTA, 190kB SPIFFS) if there is a memoty shortage
 
Usage of:
1 Screen, colours and fonts
2 BLE nRF UART connection with phone
3 RGB LED
4 RTC for time
5 Get timezone corrected time with daylight savings from a NTP server via WIFI
6 Menu driven with serial monitor, BLE and WIFI
7 Change connection settings of WIFI via BLE
8 Get time with NTP server via WIFI
9 OTA updates of the software by WIFI
               
*/
// =============================================================================================================================

//#define ESP32C3_DEV
//#define ESP32S3_DEV
#define ESP2432S028
#define ILI9341

//--------------------------------------------
// ESP32-C3 Includes defines and initialisations
//--------------------------------------------
// #define mbedtls_md5_starts_ret mbedtls_md5_starts
// #define mbedtls_md5_update_ret mbedtls_md5_update
// #define mbedtls_md5_finish_ret mbedtls_md5_finish
// #define ets_printf log_e

#include <NimBLEDevice.h>      // For BLE communication  https://github.com/h2zero/NimBLE-Arduino
#include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
#include <WiFi.h>              // Used for web page 
#include <AsyncTCP.h>          // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWebServer.h> // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <AsyncElegantOTA.h>   // Used for OTA
#include <Preferences.h>
#include "Colors.h"
//#include <TFT_eSPI.h>         // Graphics and font library for ILI9341 driver chip
#include <SPI.h>
                        #ifdef ILI9341
#include <Adafruit_ILI9341.h>  // https://github.com/adafruit/Adafruit_ILI9341
#include <Adafruit_GFX.h>      // Core graphics library, with extra fonts.
                        #endif // ILI9341
                        
#define HET     ColorLeds("Het",     0,   2, MINColor);   
#define IS      ColorLeds("is",      4,   5, SECColor);    Is = true; 
#define WAS     ColorLeds("was",     7,   9, SECColor);    Is = false;
#define MVIJF   ColorLeds("vijf",    11, 14, LetterColor); 
#define PRECIES ColorLeds("precies", 16, 22, LetterColor);
#define MTIEN   ColorLeds("tien",    25, 28, LetterColor); 
#define KWART   ColorLeds("kwart",   32, 36, LetterColor);
#define VOOR    ColorLeds("voor",    38, 41, LetterColor);
#define OVER    ColorLeds("over",    43, 46, LetterColor);
#define HALF    ColorLeds("half",    48, 51, LetterColor);
#define MIDDER  ColorLeds("midder",  53, 58, LetterColor);
#define VIJF    ColorLeds("vijf",    60, 63, LetterColor);
#define TWEE    ColorLeds("twee",    65, 68, LetterColor);
#define EEN     ColorLeds("een",     71, 73, LetterColor);
#define VIER    ColorLeds("vier",    76, 79, LetterColor);
#define ELF     ColorLeds("elf",     80, 82, LetterColor);
#define TIEN    ColorLeds("tien",    84, 87, LetterColor);
#define TWAALF  ColorLeds("twaalf",  89, 94, LetterColor);
#define DRIE    ColorLeds("drie",    97,100, LetterColor);
#define NEGEN   ColorLeds("negen",  102,106, LetterColor);
#define ACHT    ColorLeds("acht",   107,110, LetterColor);
#define NACHT   ColorLeds("nacht",  114,118, LetterColor);
#define ZES     ColorLeds("zes",    112,114, LetterColor);
#define ZEVEN   ColorLeds("zeven",  116,120, LetterColor);
#define NOEN    ColorLeds("noen",   120,123, LetterColor);
#define UUR     ColorLeds("uur",    125,127, LetterColor);
//#define EDSOFT  ColorLeds("EdSoft", 132,132, LetterColor);
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);

