ednieuw/ESP32-2432S028R-display/ESP322432S028_WordClockV016/ESP322432S028_WordClockV016.ino
uint8_t ScreenMiddleX = 160;
uint8_t ScreenMiddleY = 120;
                        #endif // ILI9341
//--------------------------------------------                                                //
// ESP32-C3 initialysations
//--------------------------------------------
bool     PrintDigital = false;                                                                // Show digital display 
bool     IP_Printed   = false;                                                                // The IP address will be printed on the display
bool     Date_Printed = false;                                                                // The date will be printed on the display  
char     Template[140];                                                                       // Contains the string with characters to be printed in the display
uint32_t LastButtonTime = 0;                                                                  // Used to avoid debouncing the button

//------------------------------------------------------------------------------
// LDR PHOTOCELL
//------------------------------------------------------------------------------
//                                                                                            //
const byte SLOPEBRIGHTNESS  = 80;                                                             // Steepness of with luminosity of the LED increases
const int  MAXBRIGHTNESS    = 255;                                                            // Maximun value in bits  for luminosity of the LEDs (1 - 255)
const byte LOWBRIGHTNESS    = 5;                                                              // Lower limit in bits of Brightness ( 0 - 255)   
byte     TestLDR            = 0;                                                              // If true LDR inf0 is printed every second in serial monitor
int      OutPhotocell;                                                                        // stores reading of photocell;
int      MinPhotocell       = 999;                                                            // stores minimum reading of photocell;
int      MaxPhotocell       = 1;                                                              // stores maximum reading of photocell;
uint32_t SumLDRreadshour    = 0;
uint32_t NoofLDRreadshour   = 0;

//--------------------------------------------
// CLOCK initialysations
//--------------------------------------------                                 

static  uint32_t msTick;                                                                      // Number of millisecond ticks since we last incremented the second counter
byte    lastminute = 0, lasthour = 0, lastday = 0, sayhour = 0;
bool    Zelftest             = false;
bool    Is                   = true;                                                          // toggle of displaying Is or Was
bool    ZegUur               = true;                                                          // Say or not say Uur in NL clock
struct tm timeinfo;                                                                           // storage of time 

//--------------------------------------------                                                //
// SCREEN Pixel initialysations
//--------------------------------------------
const byte MATRIX_WIDTH     = 16;
const byte MATRIX_HEIGHT    = 8;
const byte NUM_LEDS         = MATRIX_WIDTH * MATRIX_HEIGHT ;        
struct     LEDPrintbuffer
            { 
             char Character;  
             uint32_t RGBColor;
            } Strippos[NUM_LEDS+1];
bool     LEDsAreOff            = false;         // If true LEDs are off except time display
bool     NoTextInColorLeds     = false;         // Flag to control printing of the text in function ColorLeds()
int      Previous_LDR_read     = 512;           // The actual reading from the LDR + 4x this value /5  
uint32_t MINColor              = C_YELLOW;      //C_RED;
uint32_t SECColor              = C_YELLOW;     //C_GREEN;
uint32_t LetterColor           = C_YELLOW;      
uint32_t HourColor[24] ={C_WHITE, C_RED, C_ORANGE, C_YELLOW,  C_YELLOW_GREEN, C_GREEN,
                         C_CYAN,  C_DODGER_BLUE, C_PURPLE, C_MAGENTA, C_GOLD, C_SPRING_GREEN,
                         C_WHITE, C_CHOCOLATE, C_ORANGE, C_KHAKI, C_YELLOW_GREEN, C_BEIGE,
                         C_AQUA_MARINE,  C_SKY_BLUE, C_HOT_PINK, C_DEEP_PINK, C_CORAL, C_LAWN_GREEN};  

//--------------------------------------------                                                //
// BLE   //#include <NimBLEDevice.h>
//--------------------------------------------
BLEServer *pServer = NULL;
BLECharacteristic * pTxCharacteristic;
bool deviceConnected    = false;
bool oldDeviceConnected = false;
std::string ReceivedMessageBLE;

#define SERVICE_UUID           "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"                         // UART service UUID
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

//----------------------------------------
// WEBSERVER
//----------------------------------------
int WIFIConnected = 0;              // Is wIFI connected?
AsyncWebServer server(80);          // For OTA Over the air uploading
#include "Webpage.h"
//----------------------------------------
// NTP
//----------------------------------------
boolean syncEventTriggered = false;                                                           // True if a time even has been triggered
NTPEvent_t ntpEvent;                                                                          // Last triggered event
//----------------------------------------
// Common
//----------------------------------------
 uint64_t Loopcounter = 0;
#define MAXTEXT 140
char sptext[MAXTEXT];                    // For common print use 
bool SerialConnected = true;   
struct EEPROMstorage {                   // Data storage in EEPROM to maintain them after power loss
  byte DisplayChoice    = 0;
  byte TurnOffLEDsAtHH  = 0;
  byte TurnOnLEDsAtHH   = 0;
  byte LanguageChoice   = 0;
  byte LightReducer     = 0;
  int  LowerBrightness  = 0;
  int  UpperBrightness  = 0;
  int  NVRAMmem[24];                                                                        // LDR readings
  byte BLEOnOff         = 1;
  byte NTPOnOff         = 1;
  byte WIFIOnOff        = 1;  
  byte StatusLEDOnOff   = 1;
  int  ReconnectWIFI    = 0;                                                                // No of times WIFI reconnected 
  byte UseSDcard        = 0;
  byte WIFINoOfRestarts = 0;                                                                // If 1 than resart MCU once
  byte ByteFuture1      = 0;                                                                // For future use
  byte ByteFuture2      = 0;                                                                // For future use
  byte ByteFuture3      = 0;                                                                // For future use
  byte ByteFuture4      = 0;                                                                // For future use
  int  IntFuture1       = 0;                                                                // For future use
  int  IntFuture2       = 0;                                                                // For future use
  int  IntFuture3       = 0;                                                                // For future use
  int  IntFuture4       = 0;                                                                // For future use   
  byte UseBLELongString = 0;                                                                // Send strings longer than 20 bytes per message. Possible in IOS app BLEserial Pro 
  uint32_t OwnColour    = 0;                                                                // Self defined colour for clock display
  uint32_t DimmedLetter = 0;
  uint32_t BackGround   = 0;
  char Ssid[30];                                                                            // 
  char Password[40];                                                                        // 
  char BLEbroadcastName[30];                                                                // Name of the BLE beacon
  char Timezone[50];
  int  Checksum        = 0;
}  Mem; 
//--------------------------------------------                                                //
// Menu
//0        1         2         3         4
//1234567890123456789012345678901234567890----  
 char menu[][40] = {
 "A SSID B Password C BLE beacon name",
 "D Date (D15012021) T Time (T132145)",
 "E Timezone  (E<-02>2 or E<+01>-1)",
 "  Make own colour of:  (Hex RRGGBB)",
 "F Font  G Dimmed font H Bkgnd",
 "I To print this Info menu",
 "K LDR reads/sec toggle On/Off", 
 "L L0 = NL, L1 = UK, L2 = DE",
 "  L3 = FR, L4 = Wheel",
 "N Display off between Nhhhh (N2208)",
 "O Display toggle On/Off",
 "P Status LED toggle On/Off", 
 "Q Display colour choice      (Q0-7)",
 "  Q0 Yellow  Q1 hourly",
 "  Q2 White   Q3 All Own",
 "  Q4 Own     Q5 Wheel",
 "  Q6 Digital Q7 Analog",
 "R Reset settings @ = Reset MCU",
 "--Light intensity settings (1-250)--",
 "S=Slope V=Min  U=Max   (S80 V5 U200)",
 "W=WIFI  X=NTP& Y=BLE  Z=Fast BLE", 
 "Ed Nieuwenhuys Nov 2023" };
 
//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud //
 Serial.setDebugOutput(true);                                                                 // Serial.setDebugOutput(true); activates the LOG output to the Serial object, which in this case is attached to the USB CDC port.
 Tekstprintln("Serial started"); 


//  pinMode(TFT_LED, OUTPUT);
//  digitalWrite(TFT_LED, HIGH);                                                                 // Turn on backlight

// ledcSetup(0, 250, 8);        //ledChannel, freq, resolution);                               // configure LED PWM functionalitites 5000 Hz, 8 bits
// ledcAttachPin(TFT_LED, 0);  //ledPin, ledChannel);                                           // ILI9341 backlight on ledchannel 0 and GPIO pin TFT_LED
ledcAttachChannel(TFT_LED, 250,8, 0);  //ledPin, ledChannel);                                //For esp32 board 3.0 and higher used in  ILI9341 backlight on ledchannel 0 and GPIO pin TFT_LED 
 
